# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: '/Applications'

# brew extensions
########################
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'cask'

# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
# https://github.com/argon/mas
# brew 'argon/mas/mas'
tap 'argon/mas'
brew 'mas'

# Terminal tools
######################
tap 'clementtsang/bottom'
# tap 'wdullaer/scotty'

brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'exa'
brew 'fish'
brew 'fzf'
brew 'htop'
brew 'httpie'
brew 'iproute2mac'
brew 'starship'
brew 'tldr'
brew 'wget'
brew 'prettyping'
brew 'ncdu'
brew 'bottom'

cask 'iterm2' || true

# Productivity tools
######################
cask 'alfred'
# cask 'background-music'
# cask 'dropbox'
# cask 'firefox'
# cask 'google-backup-and-sync'
cask 'google-drive-file-stream'
# cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'vlc'

# Development tools
######################
tap 'github/gh'
tap 'neovim/neovim'
# tap 'webhookrelay/tap'
# tap 'homebrew/cask'

brew 'coreutils'
brew 'diff-so-fancy'
brew 'gh'
brew 'gist'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'neovim'
brew 'wakatime-cli'
brew 'watchman' # https://facebook.github.io/watchman/docs/install.html
brew 'postgresql'
brew 'python'

cask 'dash'
cask 'androidtool'
cask 'sourcetree'
cask 'ngrok'
cask 'dash4'

# DevOps tools
######################
tap 'derailed/k9s'
tap 'johanhaleby/kubetail'

# brew 'direnv'
brew 'dnsmasq'
brew 'jq'
brew 'k9s'
brew 'kerl'
brew 'kubetail'
brew 's3cmd'
brew 'sops'
brew 'terraform'
brew 'minikube'

cask 'google-cloud-sdk'

# Others
######################

cask 'font-fira-code'
cask 'font-hack-nerd-font'

cask 'provisionql'
cask 'quicklook-json'
cask 'betterzip'
cask 'diffmerge'

cask 'quicklook-csv'
cask 'webpquicklook'
cask 'suspicious-package'

# quicklook-csv webpquicklook suspicious-package

# ---

# rubocop:disable Style/NumericLiterals

mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
mas 'Enpass', id: 732710998
mas 'HiddenMe', id: 467040476
mas 'Keynote', id: 409183694
# mas 'Kindle', id: 405399194
mas 'Lungo', id: 1263070803
# mas 'Mahjong 2K', id: 431469123
mas 'Monosnap', id: 540348655
mas 'Numbers', id: 409203825
mas 'Shush', id: 496437906
# mas 'Simplenote', id: 692867256
mas 'Sip', id: 507257563
mas 'StuffIt Expander', id: 405580712
mas 'Telegram', id: 747648890
mas 'Todoist', id: 585829637
mas 'WhatsApp', id: 1147396723
mas 'Xcode', id: 497799835
mas 'Yoink', id: 457622435

# rubocop:enable Style/NumericLiterals
