# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: '/Applications'

# brew extensions
########################
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'cask'

# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
# https://github.com/argon/mas
# brew 'argon/mas/mas'
tap 'argon/mas'
brew 'mas'

# Terminal Tools
######################
cask 'iterm2'

# upgrade bash
brew 'bash'
brew 'bash-completion'

# install fish-shell
brew 'fish'

# https://starship.rs/ - The minimal, blazing-fast, and infinitely customizable prompt for any shell!
brew 'starship'

# Terminal basic tools
######################

# # https://github.com/ClementTsang/bottom - Yet another cross-platform graphical process/system monitor.
# tap 'clementtsang/bottom'
# brew 'bottom'

# Transports you to any directory you have visited before
# https://github.com/wdullaer/scotty
# tap 'wdullaer/scotty'
# brew 'scotty'

brew 'bat'
brew 'exa'
# brew 'fzf'
brew 'htop'
brew 'httpie'
brew 'iproute2mac'
brew 'tldr'
brew 'wget'
brew 'jq'
# Display directories as trees (with optional color/HTML output)
# http://mama.indstate.edu/users/ice/tree/
brew 'tree'
# CLI tool for quick access to files and directories
# https://github.com/clvv/fasd
# brew 'fasd'

# NCurses Disk Usage
brew 'ncdu'

# Productivity tools
######################
cask 'alfred'
# cask 'background-music'
# cask 'dropbox'
# cask 'firefox'
# cask 'google-drive'
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'vlc'
cask 'appcleaner'
cask 'sizeup'
# https://contexts.co/ - Allows switching between application windows
cask 'contexts'

# Replacement for RCDefaultApps, written in Swift - https://github.com/Lord-Kamina/SwiftDefaultApps
cask 'swiftdefaultappsprefpane'

# https://www.whatsapp.com/ - Desktop client for WhatsApp
cask 'whatsapp'

# open-in-code - 📂 macOS Finder toolbar app to open current folder in Visual Studio Code
# https://github.com/sozercan/OpenInCode
cask 'open-in-code'

# Identify Intel-only apps
# https://github.com/DigiDNA/Silicon
cask 'silicon'

# Create beautiful image of your source code
# https://github.com/Aloxaf/silicon/
brew 'silicon'

# Development tools
######################
tap 'github/gh'
brew 'gh'

tap 'neovim/neovim'
brew 'neovim'

# tap 'webhookrelay/tap'

brew 'coreutils'
brew 'wakatime-cli'

# Git related
brew 'gist'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'diff-so-fancy'
# Git Credential Manager https://docs.github.com/en/get-started/getting-started-with-git/caching-your-github-credentials-in-git#git-credential-manager
tap 'microsoft/git'
cask 'git-credential-manager-core'

# Security
brew 'gpg'
cask 'gpg-suite'

brew 'watchman' # https://facebook.github.io/watchman/docs/install.html
brew 'postgresql'
# brew 'python'

# # https://github.com/stevegrunwell/asimov - Automatically exclude development dependencies from Apple Time Machine backups
# brew 'asimov'
# run after install: sudo brew services start asimov

cask 'androidtool'
# cask 'ngrok'
# cask 'dash'
# cask 'dash4'

# https://setapp.com/
cask 'setapp'

brew 'dust'
brew 'duf'
# https://github.com/dalance/procs - A modern replacement for ps written in Rust
brew 'procs'

# https://github.com/orf/gping - Ping, but with a graph
brew 'gping'
# https://github.com/denilsonsa/prettyping - `prettyping` is a wrapper around the standard `ping` tool, making the output prettier, more colorful, more compact, and easier to read.
brew 'prettyping'
# https://www.speedtest.net/apps/cli
tap 'teamookla/speedtest'
brew 'speedtest'


# https://github.com/cantino/mcfly - Fly through your shell history. Great Scott!
tap 'cantino/mcfly'
brew 'mcfly'

# https://github.com/sharkdp/hyperfine - A command-line benchmarking tool
brew 'hyperfine'

# # https://curlie.io/ - The power of curl, the ease of use of httpie.
# tap 'rs/tap'
# brew 'curlie'

# https://github.com/ogham/dog - A command-line DNS client.
brew 'dog'

# https://github.com/ClementTsang/bottom
tap 'clementtsang/bottom'
brew 'bottom'

# https://github.com/VSCodium/vscodium - Binary releases of VS Code without MS branding/telemetry/licensing
cask 'vscodium'

# VS Code - https://code.visualstudio.com/
cask 'visual-studio-code'

# https://fork.dev - Git client
cask 'fork'

# https://www.sourcetreeapp.com - Git client
cask 'sourcetree'

# https://logseq.com - A privacy-first, open-source knowledge base
cask 'logseq'

# # DevOps tools
# ######################
# tap 'derailed/k9s'
# brew 'k9s'

# tap 'johanhaleby/kubetail'
# brew 'kubetail'

# brew 'direnv'
# brew 'dnsmasq'
# brew 'kerl'
# brew 'sops'
# brew 'terraform'
# brew 'minikube'

# https://www.datree.io required by https://marketplace.visualstudio.com/items?itemName=SuyashSonawane.vscode-datree
tap 'datreeio/datree'
brew 'datree'

# Others
######################

# required by font-fira-mono-for-powerline--svn
brew 'svn'
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono-nerd-font'
# cask 'font-hack-nerd-font'

cask 'provisionql'
cask 'quicklook-json'
cask 'betterzip'
cask 'diffmerge'

cask 'quicklook-csv'
cask 'webpquicklook'
cask 'suspicious-package'

# quicklook-csv webpquicklook suspicious-package

# ---

# rubocop:disable Style/NumericLiterals

# mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
# mas 'Enpass', id: 732710998
mas 'HiddenMe', id: 467040476
mas 'Keynote', id: 409183694
# mas 'Kindle', id: 405399194
mas 'Lungo', id: 1263070803
# mas 'Mahjong 2K', id: 431469123
# mas 'Monosnap', id: 540348655
mas 'Numbers', id: 409203825
# mas 'Shush', id: 496437906
# mas 'Simplenote', id: 692867256
# mas 'Sip', id: 507257563
mas 'StuffIt Expander', id: 405580712
mas 'Telegram', id: 747648890
# mas 'Todoist', id: 585829637
# mas 'WhatsApp', id: 1147396723
# mas 'Xcode', id: 497799835
# mas 'Yoink', id: 457622435
mas 'Unsplash Wallpapers', id: 1284863847
# safari extension
mas 'Save to Raindrop.io', id: 1549370672
mas 'Fantastical - Calendar & Tasks', id: 975937182

# rubocop:enable Style/NumericLiterals

# https://developer.1password.com/docs/cli/app-integration/
cask '1password'
cask '1password-cli'
