# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle

# specify a directory to install
cask_args appdir: '/Applications'

# brew extensions
########################
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

brew 'cask'

## ------------------------- ##
# START: Basic setup tools
## ------------------------- ##

# Terminal Tools
######################
cask 'iterm2'

# upgrade bash
brew 'bash'
brew 'bash-completion'

brew 'git'

# install fish-shell
brew 'fish'

# https://starship.rs/ - The minimal, blazing-fast, and infinitely customizable prompt for any shell!
brew 'starship'

# Core tools
######################
brew 'coreutils'

tap 'neovim/neovim'
brew 'neovim'

# https://developer.1password.com/docs/cli/app-integration/
cask '1password'
cask '1password-cli'

# VS Code - https://code.visualstudio.com/
cask 'visual-studio-code'

# https://fork.dev - Git client
cask 'fork'

# https://setapp.com/
cask 'setapp'

# https://contexts.co/ - Allows switching between application windows
cask 'contexts'

## ------------------------- ##
# START: Basic setup tools
## ------------------------- ##
